Introduction to pandas

In [1]:
import pandas as pd

There are two types of datatypes
- Series - one dimensional 
- Dataframe

In [2]:
# Pandas Series is like a column in a table
# it is an one-dimensional array holding data of any type.

series = pd.Series(['BMW','Toyota','Honda'])

Print the series variable

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
#Declaring the array for pandas Series from a list
a = [1, 3, 4, 5]
myvar = pd.Series(a)
print(myvar)

0    1
1    3
2    4
3    5
dtype: int64

In [5]:
# We can use indexing as a label to access a specified value
print(myvar[0])

1

In [6]:
# With our own we can create our own labels 
# Instead of using the normal indexing
x = [1, 3, 4, 5]
var = pd.Series(x, index = ['w','x','y','z'])
print(var)

w    1
x    3
y    4
z    5
dtype: int64

In [7]:
#When still access the specified value using the labels we have created
print(var['x'])

3

In [8]:
# We can still create Series using dictionary 
calories = {
    "day1": 420,
    "day2": 380,
    "day3": 390
}
var = pd.Series(calories)
print(var)

day1    420
day2    380
day3    390
dtype: int64

In [9]:
#Accessing the value of specified value in the dictionary we use key
# By creating own on lables which are the keys
calories = {
    "day1": 403,
    "day2": 340,
    "day3": 560
}
myvar = pd.Series(calories,index=['day1','day2'])
print(myvar)

day1    403
day2    340
dtype: int64

DATAFRAMES
dataframes are data sets are multi-dimensional table
- Series are like columns
- Dataframes are like the whole tabl

In [10]:
data = {
    'Days': [''],
    'calories': [24, 34, 56],
    'durations': [2, 4, 5]
}
mydata = pd.DataFrame(data, index=['day1','day2','day3'])
print(mydata)

     Days  calories  durations
day1             24          2
day2             34          4
day3             56          5

A pandas Dataframes is a 2 dimensional data structure, like a 2 dimensional array, or table with rows and columns

In [11]:
mydata = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
df = pd.DataFrame(mydata)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [12]:
#Locating Row
# loc attribute returns one or more specified row
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [13]:
series = pd.Series(['BMW','Toyota','Honda'])

In [14]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [15]:
colors = pd.Series(['Red', 'Blue', 'White'])

In [16]:
colors

0      Red
1     Blue
2    White
dtype: object

Creating dataframe from List of series
- series Series
- colours Series

In [17]:
data = {
    'car type': series,
    'car color': colors
}
car_data = pd.DataFrame(data)
print(car_data)

  car type car color
0      BMW       Red
1   Toyota      Blue
2    Honda     White

Importing data 
 - CSV files

In [18]:
car_sales = pd.read_csv('car_sales.csv')

In [19]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [20]:
df = pd.read_csv('data.csv')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

## Describing the data

In [21]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [22]:
df.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [23]:
# now we are describing the columns
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [24]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [25]:
# Now we are describing the dataset from function 
# to give the numeric description
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

Giving info about the dataset

In [27]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [28]:
# Calculating the mean
car_sales.mean()

C:\Users\Kios\AppData\Local\Temp\ipykernel_11092\1188277063.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [29]:
df.mean()

Duration     63.846154
Pulse       107.461538
Maxpulse    134.047337
Calories    375.790244
dtype: float64

In [30]:
#Calculating the sum
df.sum()

Duration    10790.0
Pulse       18161.0
Maxpulse    22654.0
Calories    61629.6
dtype: float64

In [31]:
#Here we are using pandas for selection of columns 
car_sales['Doors'].sum()

40

In [32]:
# We are going to check for the length of the data sets
len(df)

169

In [33]:
len(car_sales)

10

## Viewing and Selecting Data

In [34]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [35]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

 Selecting one or more rows sharing same index numer

In [38]:
sample = pd.Series(['Bird','Dog','Monkey','Lion','Leopard'],index=[1, 3, 3, 5, 6])
print(sample)

1       Bird
3        Dog
3     Monkey
5       Lion
6    Leopard
dtype: object

Using the loc[] and iloc[] functions
 - loc - refers to the referencing the position of the value
 - iloc - refes to the positioning of the value

In [40]:
sample.loc[3]

3       Dog
3    Monkey
dtype: object

In [41]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

iloc[ ] is used for positioning only not row

In [42]:
sample.iloc[3]

'Lion'

In [43]:
sample.loc[:3]

1      Bird
3       Dog
3    Monkey
dtype: object

## Selecting using square brackets

In [44]:
car_sales['Make']

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [49]:
car_sales['Colour']

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object